#  Создать программу, которая будет вычислять площадь
# треугольника, запрашивая пользователя ввести значение основания и
#  высоту. (единица измерения сантиметры)

print("Розрахунок площі трикутника по одній його стороні і висоті")
a = float(input("Введіть сторону трикутника в см.: "))

h = float(input("Введіть його висоту в см.: "))

print("Площа трикутника складає ", ((a * h)/2), 'см.кв.')